Examinator/src/InformationRegisters/НастройкиЛичногоКабинетаСУО/НастройкиЛичногоКабинетаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиЛичногоКабинетаСУО</name>
  <resources>
    <name>ПоказатьОбучение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПоказатьОбщение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПоказатьЛичныеСообщения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПоказатьНовости</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПоказатьПерсональныеНастройки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПоказатьПинКоды</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПоказатьФорумы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПоказатьБиблиотеку</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/НастройкиЛичногоКабинетаСУО/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьНастройки() Экспорт
	
	ИспользоватьЛичныйКабинет = ПолучитьФункциональнуюОпцию("ИспользоватьЛичныйКабинетСУО");
	
	ПоказатьОбучение = ИспользоватьЛичныйКабинет; 
	ПоказатьОбщение = ИспользоватьЛичныйКабинет И ПолучитьФункциональнуюОпцию("ИспользоватьУниверсальныйСервисОбщенияСУО");
	ПоказатьЛичныеСообщения = ИспользоватьЛичныйКабинет И ПолучитьФункциональнуюОпцию("ИспользоватьЛичныеСообщенияСУО");
	ПоказатьНовости = ИспользоватьЛичныйКабинет;
	ПоказатьПерсональныеНастройки = ИспользоватьЛичныйКабинет;
	ПоказатьПинКоды = ИспользоватьЛичныйКабинет И ПолучитьФункциональнуюОпцию("ИспользоватьПинКодыВПерсональныхНастройкахСУО");
	ПоказатьФорумы = ИспользоватьЛичныйКабинет И ПолучитьФункциональнуюОпцию("ИспользоватьФорумыСУО");
	ПоказатьБиблиотеку = ИспользоватьЛичныйКабинет И ПолучитьФункциональнуюОпцию("ПолныйИнтерфейсСУО");
	
	РегистрыСведений.НастройкиЛичногоКабинетаСУО.Сохранить("ПоказатьОбучение", ПоказатьОбучение);
	
	РегистрыСведений.НастройкиЛичногоКабинетаСУО.Сохранить("ПоказатьОбщение", ПоказатьОбщение);
	РегистрыСведений.НастройкиЛичногоКабинетаСУО.Сохранить("ПоказатьЛичныеСообщения", ПоказатьЛичныеСообщения);
	РегистрыСведений.НастройкиЛичногоКабинетаСУО.Сохранить("ПоказатьНовости", ПоказатьНовости);
	РегистрыСведений.НастройкиЛичногоКабинетаСУО.Сохранить("ПоказатьПерсональныеНастройки", ПоказатьПерсональныеНастройки);
	РегистрыСведений.НастройкиЛичногоКабинетаСУО.Сохранить("ПоказатьПинКоды", ПоказатьПинКоды);
	РегистрыСведений.НастройкиЛичногоКабинетаСУО.Сохранить("ПоказатьФорумы", ПоказатьФорумы);
	РегистрыСведений.НастройкиЛичногоКабинетаСУО.Сохранить("ПоказатьБиблиотеку", ПоказатьБиблиотеку);	
		
КонецПроцедуры

Функция Значение(ИмяНастройки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Настройки."+ИмяНастройки+" КАК ЗначениеНастройки
		|ИЗ
		|	РегистрСведений.НастройкиЛичногоКабинетаСУО КАК Настройки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		РеквизитРегистра = Метаданные.РегистрыСведений.НастройкиЛичногоКабинетаСУО.Ресурсы.Найти(ИмяНастройки);
		
		Если РеквизитРегистра = Неопределено Тогда
			ВызватьИсключение НСтр("ru = 'Ошибочное имя настроек личного кабинета'");
		КонецЕсли;
		
		Возврат РеквизитРегистра.Тип.ПривестиЗначение(Неопределено);
		
	Иначе		
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();

		Возврат ВыборкаДетальныеЗаписи.ЗначениеНастройки;	
	
	КонецЕсли;
	
КонецФункции

Процедура Сохранить(ИмяНастройки, ЗначениеНастройки) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.НастройкиЛичногоКабинетаСУО.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи[ИмяНастройки] = ЗначениеНастройки;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
